adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/_ipdlheaders/mozilla/net/PSocketProcessParent.h
public:
    typedef std::function<void(const bool&)> CachePushCheckResolver;
    typedef MozPromise<uint32_t, ResponseRejectReason, true> RequestMemoryReportPromise;
    typedef MozPromise<SocketDataArgs, ResponseRejectReason, true> GetSocketDataPromise;
    typedef MozPromise<nsTArray<DNSCacheEntries>, ResponseRejectReason, true> GetDNSCacheEntriesPromise;
    typedef MozPromise<nsTArray<HttpRetParams>, ResponseRejectReason, true> GetHttpConnectionDataPromise;

protected:
    virtual mozilla::ipc::IPCResult
    RecvPWebrtcTCPSocketConstructor(
            PWebrtcTCPSocketParent* actor,
            const mozilla::Maybe<TabId>& tabId);
    virtual mozilla::ipc::IPCResult
    RecvPChildToParentStreamConstructor(PChildToParentStreamParent* actor);
    virtual mozilla::ipc::IPCResult
    RecvPAltServiceConstructor(PAltServiceParent* actor);
    virtual mozilla::ipc::IPCResult
    RecvPProxyConfigLookupConstructor(
            PProxyConfigLookupParent* actor,
            nsIURI* aUri,
            const uint32_t& aFlags);
    virtual mozilla::ipc::IPCResult
    RecvPFileDescriptorSetConstructor(
            PFileDescriptorSetParent* actor,
            const FileDescriptor& fd);
    virtual mozilla::ipc::IPCResult
    RecvPDNSRequestConstructor(
            PDNSRequestParent* actor,
            const nsCString& hostName,
            const nsCString& trrServer,
            const uint16_t& type,
            const OriginAttributes& originAttributes,
            const uint32_t& flags);
    void
    ProcessingError(
            Result aCode,
            const char* aReason) override;
    bool
    ShouldContinueFromReplyTimeout() override;
    void
    EnteredCxxStack() override;
    void
    ExitedCxxStack() override;
    void
    EnteredCall() override;
    void
    ExitedCall() override;

public:
    typedef mozilla::ipc::IProtocol IProtocol;
    typedef IPC::Message Message;
    typedef base::ProcessHandle ProcessHandle;
    typedef mozilla::ipc::MessageChannel MessageChannel;
    typedef mozilla::ipc::SharedMemory SharedMemory;

public:
    MOZ_IMPLICIT PSocketProcessParent();

    virtual ~PSocketProcessParent();

public:
    void
    ManagedPDNSRequestParent(nsTArray<PDNSRequestParent*>& aArr) const;
    const ManagedContainer<PDNSRequestParent>&
    ManagedPDNSRequestParent() const;

    void
    ManagedPWebrtcTCPSocketParent(nsTArray<PWebrtcTCPSocketParent*>& aArr) const;
    const ManagedContainer<PWebrtcTCPSocketParent>&
    ManagedPWebrtcTCPSocketParent() const;

    void
    ManagedPFileDescriptorSetParent(nsTArray<PFileDescriptorSetParent*>& aArr) const;
    const ManagedContainer<PFileDescriptorSetParent>&
    ManagedPFileDescriptorSetParent() const;

    void
    ManagedPHttpTransactionParent(nsTArray<PHttpTransactionParent*>& aArr) const;
    const ManagedContainer<PHttpTransactionParent>&
    ManagedPHttpTransactionParent() const;

    void
    ManagedPHttpConnectionMgrParent(nsTArray<PHttpConnectionMgrParent*>& aArr) const;
    const ManagedContainer<PHttpConnectionMgrParent>&
    ManagedPHttpConnectionMgrParent() const;

    void
    ManagedPChildToParentStreamParent(nsTArray<PChildToParentStreamParent*>& aArr) const;
    const ManagedContainer<PChildToParentStreamParent>&
    ManagedPChildToParentStreamParent() const;

    void
    ManagedPParentToChildStreamParent(nsTArray<PParentToChildStreamParent*>& aArr) const;
    const ManagedContainer<PParentToChildStreamParent>&
    ManagedPParentToChildStreamParent() const;

    void
    ManagedPInputChannelThrottleQueueParent(nsTArray<PInputChannelThrottleQueueParent*>& aArr) const;
    const ManagedContainer<PInputChannelThrottleQueueParent>&
    ManagedPInputChannelThrottleQueueParent() const;

    void
    ManagedPAltServiceParent(nsTArray<PAltServiceParent*>& aArr) const;
    const ManagedContainer<PAltServiceParent>&
    ManagedPAltServiceParent() const;

    void
    ManagedPAltSvcTransactionParent(nsTArray<PAltSvcTransactionParent*>& aArr) const;
    const ManagedContainer<PAltSvcTransactionParent>&
    ManagedPAltSvcTransactionParent() const;

    void
    ManagedPTRRServiceParent(nsTArray<PTRRServiceParent*>& aArr) const;
    const ManagedContainer<PTRRServiceParent>&
    ManagedPTRRServiceParent() const;

    void
    ManagedPProxyConfigLookupParent(nsTArray<PProxyConfigLookupParent*>& aArr) const;
    const ManagedContainer<PProxyConfigLookupParent>&
    ManagedPProxyConfigLookupParent() const;

    void
    ManagedPNativeDNSResolverOverrideParent(nsTArray<PNativeDNSResolverOverrideParent*>& aArr) const;
    const ManagedContainer<PNativeDNSResolverOverrideParent>&
    ManagedPNativeDNSResolverOverrideParent() const;

    void
    ManagedPRemoteLazyInputStreamParent(nsTArray<PRemoteLazyInputStreamParent*>& aArr) const;
    const ManagedContainer<PRemoteLazyInputStreamParent>&
    ManagedPRemoteLazyInputStreamParent() const;

    void
    AllManagedActors(nsTArray<RefPtr<mozilla::ipc::ActorLifecycleProxy>>& arr__) const override;

    ManagedEndpoint<PDNSRequestChild>
    OpenPDNSRequestEndpoint(PDNSRequestParent* aActor);
    bool
    BindPDNSRequestEndpoint(
            ManagedEndpoint<PDNSRequestParent> aEndpoint,
            PDNSRequestParent* aActor);

    ManagedEndpoint<PWebrtcTCPSocketChild>
    OpenPWebrtcTCPSocketEndpoint(PWebrtcTCPSocketParent* aActor);
    bool
    BindPWebrtcTCPSocketEndpoint(
            ManagedEndpoint<PWebrtcTCPSocketParent> aEndpoint,
            PWebrtcTCPSocketParent* aActor);

    ManagedEndpoint<PFileDescriptorSetChild>
    OpenPFileDescriptorSetEndpoint(PFileDescriptorSetParent* aActor);
    bool
    BindPFileDescriptorSetEndpoint(
            ManagedEndpoint<PFileDescriptorSetParent> aEndpoint,
            PFileDescriptorSetParent* aActor);

    ManagedEndpoint<PHttpTransactionChild>
    OpenPHttpTransactionEndpoint(PHttpTransactionParent* aActor);
    bool
    BindPHttpTransactionEndpoint(
            ManagedEndpoint<PHttpTransactionParent> aEndpoint,
            PHttpTransactionParent* aActor);

    ManagedEndpoint<PHttpConnectionMgrChild>
    OpenPHttpConnectionMgrEndpoint(PHttpConnectionMgrParent* aActor);
    bool
    BindPHttpConnectionMgrEndpoint(
            ManagedEndpoint<PHttpConnectionMgrParent> aEndpoint,
            PHttpConnectionMgrParent* aActor);

