adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/_ipdlheaders/mozilla/net/PSocketProcessParent.h
    ManagedEndpoint<PChildToParentStreamChild>
    OpenPChildToParentStreamEndpoint(PChildToParentStreamParent* aActor);
    bool
    BindPChildToParentStreamEndpoint(
            ManagedEndpoint<PChildToParentStreamParent> aEndpoint,
            PChildToParentStreamParent* aActor);

    ManagedEndpoint<PParentToChildStreamChild>
    OpenPParentToChildStreamEndpoint(PParentToChildStreamParent* aActor);
    bool
    BindPParentToChildStreamEndpoint(
            ManagedEndpoint<PParentToChildStreamParent> aEndpoint,
            PParentToChildStreamParent* aActor);

    ManagedEndpoint<PInputChannelThrottleQueueChild>
    OpenPInputChannelThrottleQueueEndpoint(PInputChannelThrottleQueueParent* aActor);
    bool
    BindPInputChannelThrottleQueueEndpoint(
            ManagedEndpoint<PInputChannelThrottleQueueParent> aEndpoint,
            PInputChannelThrottleQueueParent* aActor);

    ManagedEndpoint<PAltServiceChild>
    OpenPAltServiceEndpoint(PAltServiceParent* aActor);
    bool
    BindPAltServiceEndpoint(
            ManagedEndpoint<PAltServiceParent> aEndpoint,
            PAltServiceParent* aActor);

    ManagedEndpoint<PAltSvcTransactionChild>
    OpenPAltSvcTransactionEndpoint(PAltSvcTransactionParent* aActor);
    bool
    BindPAltSvcTransactionEndpoint(
            ManagedEndpoint<PAltSvcTransactionParent> aEndpoint,
            PAltSvcTransactionParent* aActor);

    ManagedEndpoint<PTRRServiceChild>
    OpenPTRRServiceEndpoint(PTRRServiceParent* aActor);
    bool
    BindPTRRServiceEndpoint(
            ManagedEndpoint<PTRRServiceParent> aEndpoint,
            PTRRServiceParent* aActor);

    ManagedEndpoint<PProxyConfigLookupChild>
    OpenPProxyConfigLookupEndpoint(PProxyConfigLookupParent* aActor);
    bool
    BindPProxyConfigLookupEndpoint(
            ManagedEndpoint<PProxyConfigLookupParent> aEndpoint,
            PProxyConfigLookupParent* aActor);

    ManagedEndpoint<PNativeDNSResolverOverrideChild>
    OpenPNativeDNSResolverOverrideEndpoint(PNativeDNSResolverOverrideParent* aActor);
    bool
    BindPNativeDNSResolverOverrideEndpoint(
            ManagedEndpoint<PNativeDNSResolverOverrideParent> aEndpoint,
            PNativeDNSResolverOverrideParent* aActor);

    ManagedEndpoint<PRemoteLazyInputStreamChild>
    OpenPRemoteLazyInputStreamEndpoint(PRemoteLazyInputStreamParent* aActor);
    bool
    BindPRemoteLazyInputStreamEndpoint(
            ManagedEndpoint<PRemoteLazyInputStreamParent> aEndpoint,
            PRemoteLazyInputStreamParent* aActor);

    [[nodiscard]] bool
    SendInit(const SocketPorcessInitAttributes& aAttributes);

    [[nodiscard]] bool
    SendPreferenceUpdate(const Pref& pref);

    void
    SendRequestMemoryReport(
            const uint32_t& generation,
            const bool& anonymize,
            const bool& minimizeMemoryUsage,
            const mozilla::Maybe<FileDescriptor>& DMDFile,
            mozilla::ipc::ResolveCallback<uint32_t>&& aResolve,
            mozilla::ipc::RejectCallback&& aReject);

    [[nodiscard]] RefPtr<RequestMemoryReportPromise>
    SendRequestMemoryReport(
            const uint32_t& generation,
            const bool& anonymize,
            const bool& minimizeMemoryUsage,
            const mozilla::Maybe<FileDescriptor>& DMDFile);

    [[nodiscard]] bool
    SendSetOffline(const bool& offline);

    [[nodiscard]] bool
    SendSetConnectivity(const bool& connectivity);

    [[nodiscard]] bool
    SendInitLinuxSandbox(const mozilla::Maybe<FileDescriptor>& sandboxBroker);

    [[nodiscard]] bool
    SendInitSocketProcessBridgeParent(
            const ProcessId& processId,
            Endpoint<mozilla::net::PSocketProcessBridgeParent>&& endpoint);

    [[nodiscard]] bool
    SendInitProfiler(Endpoint<mozilla::PProfilerChild>&& aEndpoint);

    [[nodiscard]] bool
    SendSocketProcessTelemetryPing();

    [[nodiscard]] PHttpTransactionParent*
    SendPHttpTransactionConstructor(PHttpTransactionParent* actor);

    [[nodiscard]] PParentToChildStreamParent*
    SendPParentToChildStreamConstructor();

    [[nodiscard]] PParentToChildStreamParent*
    SendPParentToChildStreamConstructor(PParentToChildStreamParent* actor);

    [[nodiscard]] PHttpConnectionMgrParent*
    SendPHttpConnectionMgrConstructor(
            PHttpConnectionMgrParent* actor,
            const HttpHandlerInitArgs& aArgs);

    [[nodiscard]] bool
    SendUpdateDeviceModelId(const nsCString& aModelId);

    [[nodiscard]] bool
    SendOnHttpActivityDistributorActivated(const bool& aIsActivated);

    [[nodiscard]] PInputChannelThrottleQueueParent*
    SendPInputChannelThrottleQueueConstructor(
            PInputChannelThrottleQueueParent* actor,
            const uint32_t& meanBytesPerSecond,
            const uint32_t& maxBytesPerSecond);

    [[nodiscard]] PAltSvcTransactionParent*
    SendPAltSvcTransactionConstructor(
            PAltSvcTransactionParent* actor,
            const HttpConnectionInfoCloneArgs& aConnInfo,
            const uint32_t& aCaps);

    [[nodiscard]] bool
    SendClearSessionCache();

    [[nodiscard]] PTRRServiceParent*
    SendPTRRServiceConstructor(
            PTRRServiceParent* actor,
            const bool& aCaptiveIsPassed,
            const bool& aParentalControlEnabled,
            const nsTArray<nsCString>& aDNSSuffixList);

    [[nodiscard]] PNativeDNSResolverOverrideParent*
    SendPNativeDNSResolverOverrideConstructor(PNativeDNSResolverOverrideParent* actor);

    [[nodiscard]] bool
    SendNotifyObserver(
            const nsCString& aTopic,
            const nsString& aData);

    [[nodiscard]] PRemoteLazyInputStreamParent*
    SendPRemoteLazyInputStreamConstructor(
            PRemoteLazyInputStreamParent* actor,
            const nsID& aID,
            const uint64_t& aSize);

    void
    SendGetSocketData(
            mozilla::ipc::ResolveCallback<SocketDataArgs>&& aResolve,
            mozilla::ipc::RejectCallback&& aReject);

    [[nodiscard]] RefPtr<GetSocketDataPromise>
    SendGetSocketData();

    void
    SendGetDNSCacheEntries(
            mozilla::ipc::ResolveCallback<nsTArray<DNSCacheEntries>>&& aResolve,
            mozilla::ipc::RejectCallback&& aReject);

