adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/_ipdlheaders/mozilla/net/PSocketProcessParent.h
    [[nodiscard]] RefPtr<GetDNSCacheEntriesPromise>
    SendGetDNSCacheEntries();

    void
    SendGetHttpConnectionData(
            mozilla::ipc::ResolveCallback<nsTArray<HttpRetParams>>&& aResolve,
            mozilla::ipc::RejectCallback&& aReject);

    [[nodiscard]] RefPtr<GetHttpConnectionDataPromise>
    SendGetHttpConnectionData();

    [[nodiscard]] PFileDescriptorSetParent*
    SendPFileDescriptorSetConstructor(const FileDescriptor& fd);

    [[nodiscard]] PFileDescriptorSetParent*
    SendPFileDescriptorSetConstructor(
            PFileDescriptorSetParent* actor,
            const FileDescriptor& fd);

    [[nodiscard]] PDNSRequestParent*
    SendPDNSRequestConstructor(
            PDNSRequestParent* actor,
            const nsCString& hostName,
            const nsCString& trrServer,
            const uint16_t& type,
            const OriginAttributes& originAttributes,
            const uint32_t& flags);

    void
    RemoveManagee(
            int32_t aProtocolId,
            IProtocol* aListener) override;
    void
    DeallocManagee(
            int32_t aProtocolId,
            IProtocol* aListener) override;

    Result
    OnMessageReceived(const Message& msg__) override;

    Result
    OnMessageReceived(
            const Message& msg__,
            Message*& reply__) override;

    Result
    OnCallReceived(
            const Message& msg__,
            Message*& reply__) override;

    void
    OnChannelClose() override;

    void
    OnChannelError() override;

private:
    void
    ClearSubtree();

    ManagedContainer<PDNSRequestParent> mManagedPDNSRequestParent;
    ManagedContainer<PWebrtcTCPSocketParent> mManagedPWebrtcTCPSocketParent;
    ManagedContainer<PFileDescriptorSetParent> mManagedPFileDescriptorSetParent;
    ManagedContainer<PHttpTransactionParent> mManagedPHttpTransactionParent;
    ManagedContainer<PHttpConnectionMgrParent> mManagedPHttpConnectionMgrParent;
    ManagedContainer<PChildToParentStreamParent> mManagedPChildToParentStreamParent;
    ManagedContainer<PParentToChildStreamParent> mManagedPParentToChildStreamParent;
    ManagedContainer<PInputChannelThrottleQueueParent> mManagedPInputChannelThrottleQueueParent;
    ManagedContainer<PAltServiceParent> mManagedPAltServiceParent;
    ManagedContainer<PAltSvcTransactionParent> mManagedPAltSvcTransactionParent;
    ManagedContainer<PTRRServiceParent> mManagedPTRRServiceParent;
    ManagedContainer<PProxyConfigLookupParent> mManagedPProxyConfigLookupParent;
    ManagedContainer<PNativeDNSResolverOverrideParent> mManagedPNativeDNSResolverOverrideParent;
    ManagedContainer<PRemoteLazyInputStreamParent> mManagedPRemoteLazyInputStreamParent;
};


} // namespace net
} // namespace mozilla
namespace mozilla {
namespace ipc {
template<>
struct IPDLParamTraits <mozilla::net::PSocketProcessParent*>
{
    typedef mozilla::net::PSocketProcessParent* paramType;
    static void
    Write(
            IPC::Message* aMsg,
            mozilla::ipc::IProtocol* aActor,
            const paramType& aVar);
    static bool
    Read(
            const IPC::Message* aMsg,
            PickleIterator* aIter,
            mozilla::ipc::IProtocol* aActor,
            paramType* aVar);
};
} // namespace ipc
} // namespace mozilla

#endif // ifndef PSocketProcessParent_h
